# Data cleaning

In [1]:
import pandas as pd
import numpy as np

###Importing data-set

In [2]:
df=pd.read_csv("train2.csv")

### Displaying the dataset

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
891,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
892,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Checking the duplicates

In [4]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
888    False
889    False
890    False
891     True
892     True
Length: 893, dtype: bool

In [5]:
df.duplicated(keep='last')

0      False
1      False
2      False
3      False
4      False
       ...
888    False
889    False
890     True
891     True
892    False
Length: 893, dtype: bool

In [6]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
888    False
889    False
890    False
891     True
892     True
Length: 893, dtype: bool

In [7]:
print(df[df.duplicated()])

     PassengerId  Survived  Pclass                 Name   Sex   Age  SibSp  \
891          891         0       3  Dooley, Mr. Patrick  male  32.0      0
892          891         0       3  Dooley, Mr. Patrick  male  32.0      0

     Parch  Ticket  Fare Cabin Embarked
891      0  370376  7.75   NaN        Q
892      0  370376  7.75   NaN        Q

if present then drop the duplicates

In [8]:
df_nodup =df.drop_duplicates()

In [9]:
df.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
891,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
892,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [10]:
df_nodup.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### Handling the null values

In [11]:
df.isnull()#checking null values

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False
891,False,False,False,False,False,False,False,False,False,False,True,False
892,False,False,False,False,False,False,False,False,False,False,True,False

In [12]:
df.isnull().sum() 
# Returns the column names along with the number of NaN values in that particular column

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          689
Embarked         2
dtype: int64

Drop the na rows

In [13]:
df1=df.dropna(axis=0)

In [14]:
df1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [15]:
df.shape

(893, 12)

In [16]:
df1.shape

(183, 12)

### Imputation

In [17]:



from sklearn.impute import SimpleImputer

imputer = SimpleImputer(missing_values=np.nan, strategy='mean')#mean,median,most frequent,Constant can be used in strategy

imputer = imputer.fit(df[['Age']])
    
df['Age'] = imputer.transform(df[['Age']])

In [18]:
print(imputer)

SimpleImputer()

In [19]:
pd.options.display.max_info_columns

df['Age'].head(8)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.705545
6    54.000000
7     2.000000
Name: Age, dtype: float64

In [20]:
df.shape

(893, 12)

# One Hot Encoding

Encoding the data using Get dummies

In [21]:
df.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,29.705545,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.000000,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.000000,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.000000,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.000000,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.000000,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.000000,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.000000,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,29.705545,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.000000,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,29.705545,0,0,2649,7.2250,NaN,C

In [22]:
df2=pd.get_dummies(df,columns=['Sex'])
#df2=pd.get_dummies(df,columns=['Name'])

In [51]:
df2.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male
PassengerId,1.000000,-0.008032,-0.031807,0.033774,-0.059153,-0.003475,0.010712,-0.045617,0.045617
Survived,-0.008032,1.000000,-0.339447,-0.070088,-0.034451,0.082389,0.257927,0.543944,-0.543944
Pclass,-0.031807,-0.339447,1.000000,-0.330712,0.082118,0.017547,-0.549841,-0.133084,0.133084
Age,0.033774,-0.070088,-0.330712,1.000000,-0.232742,-0.179352,0.091323,-0.084402,0.084402
SibSp,-0.059153,-0.034451,0.082118,-0.232742,1.000000,0.415132,0.160091,0.115315,-0.115315
Parch,-0.003475,0.082389,0.017547,-0.179352,0.415132,1.000000,0.216634,0.246060,-0.246060
Fare,0.010712,0.257927,-0.549841,0.091323,0.160091,0.216634,1.000000,0.182985,-0.182985
Sex_female,-0.045617,0.543944,-0.133084,-0.084402,0.115315,0.246060,0.182985,1.000000,-1.000000
Sex_male,0.045617,-0.543944,0.133084,0.084402,-0.115315,-0.246060,-0.182985,-1.000000,1.000000

Take small sample data - data.csv

### Standardization 
Standardize generally means changing the values so that the distribution standard deviation from the mean equals one. It outputs something very close to a normal distribution. Scaling is often implied.
Many machine learning algorithms perform better or converge faster when features are on a relatively similar scale and/or close to normally distributed.

First Impute then standardize

In [53]:
# Importing the libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

# Importing the dataset
dataset = pd.read_csv('Data.csv')

X = dataset.iloc[:, :-1].values
y = dataset.iloc[:, 3].values

In [54]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [56]:
# Taking care of missing data
from sklearn.impute import SimpleImputer
mputer = SimpleImputer(missing_values =np.nan, strategy = 'mean')
mputer = mputer.fit(X[:, 1:3])
X[:, 1:3] = mputer.transform(X[:, 1:3])

In [57]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

Standardize the data

In [28]:
from sklearn.preprocessing import StandardScaler #one type of scaler
sc_X = StandardScaler()
dataset[['Age','Salary']] = sc_X.fit_transform(dataset[['Age','Salary']])

In [29]:
dataset

   Country       Age    Salary Purchased
0   France  0.719931  0.711013        No
1    Spain -1.623675 -1.364376       Yes
2  Germany -1.210098 -0.845529        No
3    Spain -0.107224 -0.240207        No
4  Germany  0.168495       NaN       Yes
5   France -0.520801 -0.499631       Yes
6    Spain       NaN -1.018478        No
7   France  1.271368  1.316334       Yes
8  Germany  1.547087  1.662233        No
9   France -0.245083  0.278640       Yes

In [30]:
from sklearn.preprocessing import minmax_scale#this is the another scaler


dataset[['Age','Salary']] = minmax_scale(dataset[['Age','Salary']])

In [31]:
#minmax_scale()

In [32]:
dataset

   Country       Age    Salary Purchased
0   France  0.739130  0.685714        No
1    Spain  0.000000  0.000000       Yes
2  Germany  0.130435  0.171429        No
3    Spain  0.478261  0.371429        No
4  Germany  0.565217       NaN       Yes
5   France  0.347826  0.285714       Yes
6    Spain       NaN  0.114286        No
7   France  0.913043  0.885714       Yes
8  Germany  1.000000  1.000000        No
9   France  0.434783  0.542857       Yes

### Encoding the Data set
Encode categorical features as a one-hot numeric array.
The input to this transformer should be an array-like of integers or strings, denoting the values taken on by categorical (discrete) features. The features are encoded using a one-hot encoding scheme. This creates a binary column for each category and returns a sparse matrix or dense array (depending on the sparse parameter)

In [58]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [59]:
from sklearn.preprocessing import OneHotEncoder #Encoding the data using one hot encoder
from sklearn.compose import ColumnTransformer
columnTransformer = ColumnTransformer([('encoder', OneHotEncoder(), [0])], remainder='passthrough')
X = np.array(columnTransformer.fit_transform(X), dtype = np.str)

In [60]:
X

array([['1.0', '0.0', '0.0', '44.0', '72000.0'],
       ['0.0', '0.0', '1.0', '27.0', '48000.0'],
       ['0.0', '1.0', '0.0', '30.0', '54000.0'],
       ['0.0', '0.0', '1.0', '38.0', '61000.0'],
       ['0.0', '1.0', '0.0', '40.0', '63777.77777777778'],
       ['1.0', '0.0', '0.0', '35.0', '58000.0'],
       ['0.0', '0.0', '1.0', '38.77777777777778', '52000.0'],
       ['1.0', '0.0', '0.0', '48.0', '79000.0'],
       ['0.0', '1.0', '0.0', '50.0', '83000.0'],
       ['1.0', '0.0', '0.0', '37.0', '67000.0']], dtype='<U17')

We use a new data set for applying Mapping below

### Using mapping Function to encode the categories
map() function returns a map object(which is an iterator) of the results after applying the given function to each item of a given iterable (list, tuple etc.)

In [63]:
df_cat = pd.DataFrame(data = 
                     [['green','M',10.1,'class1'],
                      ['blue','L',20.1,'class2'],
                      ['white','M',30.1,'class1']])

In [64]:
df_cat

       0  1     2       3
0  green  M  10.1  class1
1   blue  L  20.1  class2
2  white  M  30.1  class1

In [65]:
df_cat.columns = ['color','size','price','classlabel']

In [66]:
df_cat

   color size  price classlabel
0  green    M   10.1     class1
1   blue    L   20.1     class2
2  white    M   30.1     class1

In [67]:
size_mapping = {'M':1,'L':2}
size_mapping
df_cat['size'] = df_cat['size'].map(size_mapping)

In [68]:
df_cat

   color  size  price classlabel
0  green     1   10.1     class1
1   blue     2   20.1     class2
2  white     1   30.1     class1

# sklearn.preprocessing.LabelEncoder

Label Encoding using the Label Encoder Package

# Cleaning Regular Expressions

In [42]:
# dictionary of lists 
dictionary = {"Name":["Alex", "Mike", "John", "Dave", "Joey"], 
        "Height(m)": [1.75, 1.65, "-", "na", 1.82], 
        "Test Score":[70, np.nan, 8, 62, 73]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dictionary)

In [43]:
df

   Name Height(m)  Test Score
0  Alex      1.75        70.0
1  Mike      1.65         NaN
2  John         -         8.0
3  Dave        na        62.0
4  Joey      1.82        73.0

In [44]:
df = df.replace(['-','na'], np.nan)

In [45]:
df

   Name  Height(m)  Test Score
0  Alex       1.75        70.0
1  Mike       1.65         NaN
2  John        NaN         8.0
3  Dave        NaN        62.0
4  Joey       1.82        73.0


## Detecting Multicollinearity using VIF
Here is a dataset determining the salary of a person in a company based on the following features:



*   Gender (0 â€“ female, 1- male)
*   Age
*   Years of service (Years spent working in the company)
*   Education level (0 â€“ no formal education, 1 â€“ under-graduation, 2 â€“ post-graduation)

In [46]:
#df=pd.read_csv(r'salary.csv')
df=pd.read_csv('salary.csv')
df.head()

   Gender  Age  Year of service  Education level  Salary
0       0   27              1.7                0   39343
1       1   26              1.1                1   43205
2       1   26              1.2                0   47731
3       0   27              1.6                1   46525
4       0   26              1.5                1   40891

### VIF (Variable Inflation Factors)
VIF score of an independent variable represents how well the variable is explained by other independent variables.

R^2 value is determined to find out how well an independent variable is described by the other independent variables. A high value of R^2 means that the variable is highly correlated with the other variables. 

## VIF=1/(1-R^2)

So, the closer the R^2 value to 1, the higher the value of VIF and the higher the multicollinearity with the particular independent variable. <br>

 A VIF of 5 or 10 and above indicates a multicollinearity problem.<br><br>
 The Variance Inflation Factor (VIF) measures the impact of collinearity among the variables in a regression model. The Variance Inflation Factor (VIF) is 1/Tolerance, it is always greater than or equal to 1. There is no formal VIF value for determining presence of multicollinearity. Values of VIF that exceed 10 are often regarded as indicating multicollinearity, but in weaker models values above 2.5 may be a cause for concern. <br><br>In many statistics programs, the results are shown both as an individual R2 value (distinct from the overall R2 of the model) and a Variance Inflation Factor (VIF). When those R2 and VIF values are high for any of the variables in your model, multicollinearity is probably an issue. When VIF is high there is high multicollinearity and instability of the b and beta coefficients. It is often difficult to sort this out.

In [47]:
# Import library for VIF
from statsmodels.stats.outliers_influence import variance_inflation_factor

def calc_vif(X):

    # Calculating VIF
    vif = pd.DataFrame()
    vif["variables"] = X.columns
    vif["VIF"] = [variance_inflation_factor(X.values, i) for i in range(X.shape[1])]

    return(vif)

VIF starts at 1 and has no upper limit
VIF = 1, no correlation between the independent variable and the other variables
VIF exceeding 5 or 10 indicates high multicollinearity between this independent variable and the others.
<br>
A data set that has VIF values within 10

In [48]:
#X = df.iloc[:,:-1]
X = df.iloc[:,:]

calc_vif(X)

         variables           VIF
0           Gender    480.073532
1              Age  17374.577260
2  Year of service  13358.911324
3  Education level     50.992446
4           Salary      1.494600

## Fixing Multicollinearity
Dropping one of the correlated features will help in bringing down the multicollinearity between correlated features:

In [49]:
#X = df.drop(['Age','Year of service'],axis=1)
X = df.drop(['Age'],axis=1)
 
calc_vif(X)

         variables         VIF
0           Gender   14.499819
1  Year of service  188.936331
2  Education level    3.547660
3           Salary  277.846220

### Or
We can combine the correlated variables into one and drop the others. This will reduce the multicollinearity

In [69]:
df.apply(lambda x : x['Age'] - x['years'],axis=1)
        
df2 = df.copy()
df2['Age_at_joining'] = df.apply(lambda x: x['Age'] - x['Year of service'],axis=1)
#we are dropping salary because that is the Target values. we do not need to calcualte teh VIF for salary.
#we calculate the VIF only for the independent variables

X = df2.drop(['Age','Year of service','Salary'],axis=1)
calc_vif(X)

KeyError: 'years'

# Hetroscedaticity

In [ ]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [ ]:
df = pd.read_csv('monthly_gold_price_index_fred.csv', header=0, infer_datetime_format=True, parse_dates=[0], index_col=[0])
print(df.head(10))

In [ ]:
df['Time_Period'] = range(1, len(df)+1)
print(df.head(10))

Plot the data:

In [ ]:
#Create a new mpyplot figure to plot into
fig = plt.figure()
#Set the title of the plot
fig.suptitle('Export Price Index of Gold')
#Set the X and Y axis labels
plt.xlabel('Time Period')
plt.ylabel('Price Index')
#plot the time series and store the plot in the actual variable. We'll need that later for the legend.
actual, = plt.plot(df['Time_Period'], df['Export_Price_Index_of_Gold'], 'bo-', label='Gold Price Index')
#Set up the legend. There is only one time series in the legend.
plt.legend(handles=[actual])
#Show everything
plt.show()

### Take the log-transform of the dependent variable
Taking the log transform of the dependent variable is one of the most commonly used techniques for not only linearizing the dependent variable y but for also dampening down the heteroscedastic variance (if it exists) in y.
Letâ€™s add a new column to the Data Frame called LOG_Export_Price_Index_of_Gold containing. Weâ€™ll use numpy.log() to do this.

In [ ]:
df['LOG_Export_Price_Index_of_Gold'] = np.log(df['Export_Price_Index_of_Gold'])

In [ ]:
#Create a new mpyplot figure to plot into
fig = plt.figure()
#Set the title of the plot
fig.suptitle('Export Price Index of Gold')
#Set the X and Y axis labels
plt.xlabel('Time Period')
plt.ylabel('Price Index')
#plot the time series and store the plot in the actual variable. We'll need that later for the legend.
actual, = plt.plot(df['Time_Period'], df['LOG_Export_Price_Index_of_Gold'], 'bo-', label='Gold Price Index')
#Set up the legend. There is only one time series in the legend.
plt.legend(handles=[actual])
#Show everything
plt.show()

### Fit an OLS linear regression model to the log-transformed data set

Import the regression packages:

In [ ]:
import statsmodels.api as sm
import statsmodels.formula.api as smf
from patsy import dmatrices

Form the model expression in patsy syntax. We are telling Patsy that LOG_Export_Price_Index_of_Gold depends on Time_Period. Patsy will auto-include the intercept Î²_0:

In [ ]:
expr = "LOG_Export_Price_Index_of_Gold ~ Time_Period"

Build and train the OLSR model:

In [ ]:
olsr_results = smf.ols(expr, df).fit()

Plot the residual errors (stored in the olsr_results.resid field) against the Time_Period:

In [ ]:
#Create a new pyplot figure to plot into
fig = plt.figure()
#Set the title of the plot
fig.suptitle('Residual errors against Time_Period')
#Set the X and Y axis labels
plt.xlabel('Time_Period')
plt.ylabel('Residual Errors')
#plot the time series and store the plot in the actual variable. 
actual, = plt.plot(df['Time_Period'], olsr_results.resid, 'go-', label='Residual Errors')
#Set up the legend. There is only one time series in the legend.
plt.legend(handles=[actual])
#Show everything
plt.show()